{
  "architectures": [
    "DeepseekV4ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 0,
  "eos_token_id": 248044,
  "expert_dtype": "fp4",
  "hc_eps": 1e-06,
  "hc_mult": 4,
  "hc_sinkhorn_iters": 20,
  "head_dim": 256,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "index_head_dim": 128,
  "index_n_heads": 32,
  "index_topk": 512,
  "initializer_range": 0.02,
  "max_position_embeddings": 1048576,
  "model_type": "deepseek_v4",
  "moe_intermediate_size": 512,
  "n_routed_experts": 256,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 32,
  "num_experts_per_tok": 8,
  "num_hash_layers": 3,
  "num_hidden_layers": 40,
  "num_key_value_heads": 1,
  "num_nextn_predict_layers": 1,
  "o_groups": 8,
  "o_lora_rank": 512,
  "q_lora_rank": 512,
  "qk_rope_head_dim": 64,
  "quantization_config": {
    "activation_scheme": "dynamic",
    "fmt": "e4m3",
    "quant_method": "fp8",
    "scale_fmt": "ue8m0",
    "weight_block_size": [
      128,
      128
    ]
  },
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "beta_fast": 32,
    "beta_slow": 1,
    "factor": 16,
    "original_max_position_embeddings": 65536,
    "type": "yarn"
  },
  "rope_theta": 10000,
  "routed_scaling_factor": 1.5,
  "scoring_func": "sqrtsoftplus",
  "sliding_window": 128,
  "swiglu_limit": 10.0,
  "tie_word_embeddings": false,
  "topk_method": "noaux_tc",
  "torch_dtype": "bfloat16",
  "transformers_version": "4.57.1",
  "use_cache": true,
  "vocab_size": 248320,
  "compress_rope_theta": 160000,
  "compress_ratios": [
    0,
    0,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    4,
    128,
    0
  ],
  "parameter_count_note": {
    "target": "DeepSeek V4 architecture at Qwen3.5-35B-A3B scale",
    "remote_host": "cudo-h100",
    "estimated_total_parameters": 35089736272,
    "estimated_active_parameters_per_token": 3103973968,
    "counting_assumptions": "Remote logical architecture count from DeepSeek-V4 inference/model.py modules. Includes embeddings, untied LM head, 40 transformer blocks, 1 MTP block, MLA/compressor/indexer/Hyper-Connections, all routed experts for total, top-8 routed plus shared expert for active, and hash tid2eid tensors. Excludes quantization scale tensors and runtime KV-cache buffers."
  }
}
